a = 111

b = 222

c = a + b           # 333 int

 

a = 1.0

b = 2

c = a + b           # 3.0 float

 

a = 100

b = 0.001

c = a + b           # 100.001 float

 

a = 0.95

b = 5.05

c = a + b           # 6.0 float

 

a = '123'

b = 0.0

c = a + b           # данные типы данных (str и float) не складываются и не конкатенируются

 

a = 55

b = '-55'

c = a + b           # переменная b является строкой, переменная a - целым числом. Соотвественно сложение не возможно

 

a = '55'

b = ' 88'

c = a + b           # '55 88' str

 

a = '0.25'

b = '0.75'

c = a + b           # '0.250.75' str

 

a = 0

b = 0.0

c = a + b           # 0.0 float