# 1. как и зачем используют input() - Когда input() вызывается, поток программы останавливается до тех пор,
# пока пользователь не введет данные через командную строку. Для ввода нужно нажать Enter после завершения набора текста.


# 2. какой тип данных она возвращает - str

# 3. как с помощью функции input() получить целое число - int(input())

# 4. как получить вещественное число (число с плавающей точкой) - floar(input())

# 5. что будет, если в круглых скобках написать какую-нибудь строку. Например, input(‘Введите число: ’) - в консоли выведится строка "Введите число: "
